04_OpenFoam/_ref/OpenFOAM-14/incompressibleVoF/parshallFlume/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication createZones

runApplication decomposePar
runParallel foamRun

runApplication reconstructPar

#------------------------------------------------------------------------------
